# Removes Stopwords from the given list and returns a new list
# Author  : Syed Awais Kazmi
# COMSATS : SP15-R01-009

# List of 203 stopwords list
# encoding = utf-8
from task1_ import array_questions
from multi import task
from nltk import word_tokenize

a = task()

stopwords = ["بلکہ","بعض","ہوں","بڑی","بعد","بہت","بھی","بے","پاس","پہلے","پر","پھر","تا","ہیں","تاکہ","تب","تجھ","تجھے","تک","تمام","تمہارا","تمہارے","تم","تمھارے","تمہاری"
    ,"تمھیں","تمہیں","تھا","تھے","تھی","تھیں","تو","تیری","تیرے","جا","جاتا","جاتی","جاتے","جاتی","جانی","جانے","جاؤ","جائے","جائیں","جب","جس","جن", "ساتھ",
      "جنہوں","جنہیں","جو","جیسا","جیسے","جیسی", "جیسوں","چاہیئے","چلا","چاہے","چونکہ","حالاں","حالانکہ","دو","دونوں","دوں","دے","دی","دیا","دیں", "ہوں",
      "دیے","دیتا","دیتے","دیتی","دینا","دینے","دینی","دیئے","ڈالا","ڈالنا","رہتے","رہنا","رہنے","رہتی","رہنی","رہو","رہے","رہی","رہیں","زیادہ","سا",
      "سامنے","سب","سکتا","سو","سے","سی","شاید","صرف","طرح","طرف","عین","کا","کبھی", "کچھ","کہہ","کر","کرتا","کرتے","کرتی","کرنا","کرنے","کرو","کروں",
      "کرے","کریں","کس","کسے","کسی","کہ","کہا","کو","کہے","کون","کوئی","کے","کی","کیا","کیسے","کیونکہ","کیوں","کیے","کئے","گا","گویا","گے","گی","گیا",
      "گئے","گئی","لا","لاتا","لاتے","لاتی","لانا","لانے","لانی","لایا","لائے","لائی","لگا","لگے","لگی","لگیں","لو","لے","لی","لیا","لیتا","لیتے","لیتی","لیکن",
      "لیں","لیے","لئے","مجھ","مجھے","مگر","میرا","میرے","میری","میں","نا","نہ","نہایت","نہیں","نے","ہر","ہاں","ہم","ہمارا","ہمارے","ہماری","ہو",
      "ہوا","ہوتا","ہوتے","ہوتی","ہوتیں","ہوں","ہونا","ہونگے","ہونے","ہونی","ہوئے","ہوئی","ہوئیں","ہے","ہی","رکھی","رکھے","رکھنی","رکھنا","رکھنے",
      "رکھتے","رکھتا","ذرا","ڈالنے","ڈالنی","ڈالے","ڈالی","رکھا","رکھتی","رہ","رہا","رہتا","ہیں","و","والا","والوں","والے","والی","وہ","اسی","طرح",
      "ایسے","بعد","والی","اپنے","صرف","ہم","کیونکہ","آ","ٓآ","سب","کردیا","کرکے","ان","اب","تھا","نہیں","جا","جس","کسی","اس","نہ","دیا","ہے",
      "گیا","جو","کیا","کا","آئی","آئے","آج","آخر","ادھر","اردگرد","اطراف","الگ","اور","اچھی","اچھے","اکثر","اکٹھی","اکٹھے","اکیلا","اکیلی","اکیلے",
      "اگرچہ","ایک","تر","تن","تو","توبم","توہی","توہیں","تک","تھوڑا","تھوڑی","تھوڑے","تھی","تھے","در","دفعہ","دو","دور","دی","دیتی","دیتے","دیر",
      "دیکھو","دیکھی","دیکھیں","دے","رریعہ","رریعے","رکي","رکھ","رکھتی","رکھتے","رکھی","رکھے","رہب","رہی","رہے","صورت","صورتوں","صورتیں","ضرور","ہیں",
      "ضرورت","ضروری","طرف","طور","طورپر","فرد","فی","لئے","لا","لازهی","لو","لوجب","لوجی","لوجے","لوگ","لوگوں","لگتب","لگتی","لگتے","لگٌب","لگی","ہے",
      "لگیں","لگے","لی","لیں","لے","هیں","و","وار","والے","وٍ","ًئی","ًئے","ًب","ًو","ًکتہ","ًہ","ًہیں","ٹھیک","پبئے","پر","پورا","پوچھب","پوچھتب","پوچھتی",
      "پوچھتے","پوچھو","پوچھوں","پوچھیں","پچھلا","پھر","پہلا","پہلی","چلا","چلو","چلیں","چلے","چکب","چکی","چکیں","چکے","ک","کئی","کئے","کب","کرتی","کرتے",
      "کرتےہو","کررہب","کررہی","کررہے","کرو","کریں","کرے","کل","کن","کوئی","کھولا","کھولو","کھولی","کھولیں","کھولے","کہ","کہب","کہتب","کہتی","کہتے","کہو",
      "کہوں","کہٌب","کہی","کہیں","کہے","کی","کیب","کیطب","کیطرف","کیطے","کیلئے","کیوًکہ","کیوں","کیے","کے","کےرریعے","گئی","گئے","گی","گے","ہر","ہن","ہو",
      "ہوئی","ہوئے","ہوا","ہوبرا","ہوبری","ہوبرے","ہوتب","ہوتی","ہوتے","ہورہی","ہورہے","ہوچکی","ہوچکے","ہوگئی","ہوگئے","ہوں","ہی","ہیں","ہے",
      "یہ","یہبں","سے","کو","کر","میں","نے","بھی","ملی""وہاں","وہی","وہیں","یا","یعنی","یہ","یہاں","یہی","یہیں"]


def stop_words_removal(data):
    #print(len(stopwords))
    number_of_stopwords=len(stopwords)
    data_length=len(data)
    for x in range(0,number_of_stopwords):
        for y in range(0,data_length):
            
            # Match Each word with the list of stopwords and
            # assign them an empty string if they are a stopword
            if(stopwords[x]==data[y]):
                data[y]=""
    
    new_data=[]
    find_it="۔"
    flag=0
    changed=""
    k=0
    for j in range(0,data_length):
        if data[j] not in ['', '[',']',"'",'،']:
            if(data[j].find(find_it)!=-1):
                flag=1
                changed=str(data[j]).replace('n','')
                changed=str(changed).replace('\\','')
                changed=str(changed).replace('۔','')            
            if(flag==1):
                new_data.insert(k,changed)
                flag=0
                k=k+1
                
            else:
                new_data.insert(k,data[j])
                k=k+1
    
    # now join the data by adding space between each word
    without_stopwords = ' '.join(new_data).split()
    return without_stopwords


#ex = word_tokenize(u"آپ کی پسندیدہ خوشبو کون سی ہے")
#print(ex)
#print(stop_words_removal(ex))
#print(ex)

#print(a)

#c = stop_words_removal(a)
#print(c)
#v = []
#for l in a:
#   v.append(stop_words_removal(l))

#print(v)
